API/app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("pet_id", "vet_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pet_id", 1], ["vet_id", 1], ["date", "2021-12-24 00:00:00"], ["created_at", "2021-12-20 03:57:30.994590"], ["updated_at", "2021-12-20 03:57:30.994590"]]
---
    def create
        binding.pry
        if Appointment.create(appointment_params)