API/app/controllers/pets_controller.rb

    def index
        @pets = Pet.all.where(user_id: current_user.id)
        @vets = User.all.where(role: 'vet')
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = $1  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", 1]]

      def create
        if Pet.create(name: params[:name], user_id: current_user.id)
---
INSERT INTO "pets" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "first pet"], ["user_id", 2], ["created_at", "2021-12-20 03:45:17.934292"], ["updated_at", "2021-12-20 03:45:17.934292"]]

      def show
          @pet = Pet.find(params[:id])
          @appointments = Appointment.all.where(pet_id: @pet.id)
          @vet = nil
          if @pet.vet_id
            @vet = User.find(@pet.vet_id)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = $1  [["pet_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def register
        pet = Pet.find(params[:pet_id])
        pet.vet_id = params[:vet_id]
        if pet.save
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pets" SET "updated_at" = $1, "vet_id" = $2 WHERE "pets"."id" = $3  [["updated_at", "2021-12-20 03:46:34.654822"], ["vet_id", 1], ["id", 1]]