API/app/controllers/users_controller.rb

    def create
      user = User.create!(user_params)
---
INSERT INTO "users" ("role", "name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def vet_pets
      @pets = Pet.where(vet_id: current_user.id)
---
SELECT "pets".* FROM "pets" WHERE "pets"."vet_id" = $1  [["vet_id", 7]]

    def vet_appointments
      @appointments = Appointment.where(vet_id: current_user.id)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."vet_id" = $1  [["vet_id", 3]]

    def vet_pet_appointment
      @pet = Pet.find(params[:pet_id])
      @appointments = Appointment.where(pet_id: params[:pet_id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = $1  [["pet_id", 9]]